hiperiondev/esp32idf_APRS/main/aprs_service.c
/**
 * @file aprs_service.c
 *
 * @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
 * @date 2026
 * @copyright GNU General Public License v3
 * @see https://github.com/hiperiondev/esp32idf_APRS
 *
 * @note
 * This is based on other projects:
 *     VP-Digi: https://github.com/sq8vps/vp-digi
 *     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
 *     LibAPRS: https://github.com/markqvist/LibAPRS
 *
 *     please contact their authors for more information.
 *
 * @brief APRS application layer: maps g_config onto the modem configuration,
 * installs the modem RX callback that feeds the digipeater, IGate, message,
 * lastheard and trafficlog components, provides the TNC2 transmit path and runs
 * the periodic service tick.
 */

#include <stdio.h>
#include <string.h>

#include "esp_log.h"
#include "esp_random.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include "afsk.h"
#include "ax25.h"
#include "esp32idf_radioamateur_modem.h"
#include "esp32idf_radioamateur_modem_config.h"
#include "modem.h"

#include "app_config.h"
#include "aprs_filter.h"
#include "aprs_service.h"
#include "beacon.h"
#include "digirepeater.h"
#include "igate.h"
#include "lastheard.h"
#include "message.h"
#include "trafficlog.h"
#include "weather.h"

static const char *TAG = "aprs_service";

// How many frames aprs_service_send_tnc2() lets pile up in the RF TX ring
// before it starts discarding new packets instead of queuing them (see the
// comment inside that function). The ring itself has room for far more
// (FRAME_MAX_COUNT-1 slots in ax25.c), but a long backlog just means later
// packets go out stale, so this caps it well below that.
#define RF_TX_QUEUE_LIMIT 2

// ---------------------------------------------------------------------------
// Modem configuration
//
// Single mapping point from g_config to the component's modem_config_t, used
// by main.c at boot, by page_radio.c's Save (live re-apply, no reboot) and by
// the LOOP TEST below (which only overrides full_duplex).
//
// Deliberately NOT mapped, because the new component takes none of them at
// runtime:
//   adc_gpio / dac_gpio
//       -> compile-time MODEM_ADC_GPIO / MODEM_DAC_GPIO, set in the
//          top-level CMakeLists.txt. Changing the audio front-end pins
//          still requires a rebuild.
//   rf_ptt_gpio / rf_ptt_active
//       -> NOW mapped at runtime (below) to modem_config_t.ptt_gpio /
//          .ptt_active_high, validated by afsk_ptt_gpio_is_valid(). The
//          MODEM_PTT_GPIO / MODEM_PTT_ACTIVE_HIGH compile-time macros only
//          supply the fallback default in MODEM_DEFAULT_CONFIG() now.
//   rf_sql_gpio / rf_sql_active / rf_pwr_gpio / rf_pwr_active
//       -> no equivalent at all. The component gates RX on the demodulator's
//          own DCD rather than on a hardware squelch line, and has no RF
//          power-switch output.
//   adc_atten -> compile-time MODEM_ADC_ATTEN (ADC_ATTEN_DB_12).
//   sql_level / volume / agc_max_gain -> no equivalent. The component's AGC is
//          self-limiting and there is no software squelch or RX gain trim.
// Those g_config fields are still loaded/saved so an existing config.json keeps
// working, and page_mod.c still edits the pin numbers, but nothing in the audio
// modem path reads them any more.
// ---------------------------------------------------------------------------
void aprs_service_build_modem_config(modem_config_t *cfg, bool full_duplex) {
    modem_config_t base = MODEM_DEFAULT_CONFIG();
    *cfg = base;

    // afskModem on the Radio page: 0=300 Bd, 1=1200 Bd Bell202, 2=1200 Bd V.23,
    // 3=9600 Bd G3RUH. modem_mode_t uses exactly the same numbering
    // (MODEM_MODEM_AFSK300=0 .. MODEM_MODEM_G3RUH=3), which is why this is a
    // plain cast; page_radio.c already clamps the field to 0-3.
    cfg->modem = (modem_mode_t)g_config.afsk_modem_type;

    // audioLPF fed the old afskSetModem()'s bpf argument, which that function
    // assigned straight to ModemConfig.flatAudioIn - i.e. despite the name it
    // always was the flat-audio-input flag, and modem_config_t.flat_audio is
    // the same bit. Kept as a direct mapping so the saved setting keeps its
    // existing meaning.
    cfg->flat_audio = g_config.audio_lpf;

    cfg->preamble_ms = g_config.preamble;
    cfg->slot_time_ms = g_config.tx_timeslot;
    cfg->fx25_mode = g_config.fx25_mode;
    cfg->allow_non_aprs = false;

    // PTT pin is now runtime-selectable (Radio/Modem page) instead of the
    // old compile-time-only MODEM_PTT_GPIO. afsk_ptt_gpio_is_valid() rejects
    // input-only pins (GPIO34-39), the internal flash/PSRAM pins (GPIO6-11)
    // and whichever pins are already wired to the ADC/DAC audio path
    // (MODEM_ADC_GPIO / MODEM_DAC_GPIO), so a stale or hand-edited
    // config.json can never key up an audio pin or a non-output pin.
    // -1 always means "PTT disabled" and passes validation unchanged.
    cfg->ptt_gpio = afsk_ptt_gpio_is_valid(g_config.rf_ptt_gpio) ? g_config.rf_ptt_gpio : -1;
    cfg->ptt_active_high = g_config.rf_ptt_active;

    // Half duplex for real on-air use: MODEM_DEFAULT_CONFIG() ships full
    // duplex (it targets the wire-loopback demo), which would key up over
    // anyone already transmitting. CSMA/quiet time comes from txTimeSlot.
    // The LOOP TEST passes true here because a DAC->ADC wire means the node
    // always hears its own carrier and would never see a clear channel.
    cfg->full_duplex = full_duplex;
}

// ---------------------------------------------------------------------------
// Dashboard statistics.
//
// These are the counters the web dashboard's STATISTICS panel actually wants
// (page_common.c's page_sidebar_info()): total RF frames decoded, total RF
// frames transmitted, frames relayed RF->INET and INET->RF, digipeated
// frames, and drop/error counts - all independent of whether the digipeater
// or IGate features are even enabled.
//
// This used to be improvised from digi_get_stats()/igate_get_stats(), whose
// counters only increment from inside digiProcess()/igateProcess() - which
// are only ever called when g_config.digi_en / g_config.igate_en are true
// (see aprs_msg_callback() below). With both features off (a very common
// RX-only/monitor setup), every counter on the dashboard stayed at 0 forever,
// regardless of how much real RF traffic the modem was decoding. Tracking
// these directly at the points where frames actually flow (on_rx_frame(),
// aprs_service_send_tnc2(), inet2rfHandler(), and inside aprs_msg_callback()
// for the digi/igate/error cases) makes the dashboard reflect reality
// whether or not either feature is turned on.
static volatile uint32_t s_statRadioRx = 0;  // frames decoded off RF (every on_rx_frame() call)
static volatile uint32_t s_statRadioTx = 0;  // frames transmitted on RF (every successful aprs_service_send_tnc2())
static volatile uint32_t s_statRf2Inet = 0;  // frames relayed from RF to APRS-IS (igateProcess() actually uplinked one)
static volatile uint32_t s_statInet2Rf = 0;  // lines relayed from APRS-IS to RF (inet2rfHandler() actually transmitted one)
static volatile uint32_t s_statDigi = 0;     // frames digipeated (path rewritten and re-transmitted)
// The two below close the gap left by the previous dashboard-statistics fix
// (see page_common.c's page_sidebar_info()): digi_get_stats()/igate_get_stats()
// are still the only place any *feature-specific* drop/error accounting
// exists, but their counters only move while digi_en/igate_en are on. For a
// monitor/RX-only setup (both features off - very common while
// characterizing modem decode performance), that left DROP/ERR pinned at 0
// forever even with plenty of real RF activity. These two are tracked at
// every point a frame is actually discarded - on the RX side in
// on_rx_frame()/aprs_msg_callback(), and on the TX side in
// aprs_service_send_tnc2() (RF TX queue full, oversized packet, modem not
// ready yet, or modem_send_tnc2() itself failing) - so they move regardless
// of which higher-level features are enabled and regardless of which
// direction the discard happens in.
static volatile uint32_t s_statDrop = 0; // frames discarded before dispatch or on the way out to RF (placeholder/invalid source callsign, modem-not-ready, TX queue full, oversized packet, etc.)
static volatile uint32_t s_statErr = 0;  // frames that failed to decode as valid APRS (UI, no-layer-3) AX.25, or that the modem itself failed to transmit (modem_send_tnc2() error)

aprs_service_stats_t aprs_service_get_stats(void) {
    aprs_service_stats_t s;
    s.radio_rx = s_statRadioRx;
    s.radio_tx = s_statRadioTx;
    s.rf2inet = s_statRf2Inet;
    s.inet2rf = s_statInet2Rf;
    s.digi = s_statDigi;
    s.drop = s_statDrop;
    s.err = s_statErr;
    return s;
}

void aprs_service_apply_modem_config(void) {
    if (!aprs_service_modem_ready())
        return;
    modem_config_t cfg;
    aprs_service_build_modem_config(&cfg, false);
    modem_set_modem(&cfg);
    ESP_LOGI(TAG, "modem re-applied: modem=%u flatAudio=%d preamble=%ums slot=%ums fx25=%u", (unsigned)cfg.modem, (int)cfg.flat_audio,
             (unsigned)cfg.preamble_ms, (unsigned)cfg.slot_time_ms, (unsigned)cfg.fx25_mode);
}

// Set true once main.c has actually called modem_init() successfully (i.e.
// the audio modem is enabled in config *and* the hardware came up since boot -
// toggling the checkbox without rebooting does not re-run modem_init).
static volatile bool s_modemReady = false;

// ---------------------------------------------------------------------------
// TX helper
//
// The old APRS_sendTNC2Pkt(raw, len) took a pointer+length; the component's
// modem_send_tnc2() takes a NUL-terminated string (it copies into a scratch
// buffer for ax25_encode(), which uses strtok on the digipeater path). Callers
// here hand us slices of larger buffers that are not always NUL-terminated at
// exactly `len`, so terminate explicitly rather than trusting the caller.
//
// Exported (beacon.c calls it too) so the pointer+length -> NUL-terminated
// conversion and the length check live in exactly one place.
// ---------------------------------------------------------------------------
bool aprs_service_send_tnc2(const char *packet, size_t len) {
    char buf[AX25_FRAME_MAX_SIZE];

    if (len == 0)
        return false;

    // Drop rather than queue when the modem was never brought up. Two ways to
    // get here: the audio modem is disabled on the Radio page, or - and this
    // is the one that bites - aprs_service_start() now runs BEFORE
    // modem_init() (it has to: it installs the RX callback), and it starts the
    // beacon tasks, which transmit immediately on entry rather than after
    // their first interval. modem_init() blocks for ~5 s measuring the ADC
    // clock, so without this a boot-time beacon would reach
    // Ax25WriteTxFrame() before Ax25Init() had run.
    if (!s_modemReady) {
        s_statDrop++;
        ESP_LOGD(TAG, "modem not up, RF TX dropped: %.*s", (int)len, packet);
        return false;
    }
    // Allow a small backlog rather than discarding the moment one frame is
    // in flight: up to RF_TX_QUEUE_LIMIT frames may sit in the ring
    // (waiting to key up or on the air right now) before a new packet is
    // dropped instead of queued. Ax25WriteTxFrame() would otherwise happily
    // queue far more (FRAME_MAX_COUNT-1 slots) and, under sustained load
    // (e.g. INET2RF gating faster than the RF channel can clear), eventually
    // drop it anyway once the ring fills - capping the backlog here instead
    // keeps queued packets from going stale and makes the reason visible on
    // the serial console. This only ever touches the RF TX ring - it has no
    // effect on the separate APRS-IS socket buffer used by igate_send_raw(),
    // so a busy RF leg never blocks or drops the IGate leg of the same
    // packet.
    uint8_t pending = modem_tx_queue_depth();
    if (pending >= RF_TX_QUEUE_LIMIT) {
        s_statDrop++;
        ESP_LOGW(TAG, "RF TX queue full (%u/%u pending), packet discarded: %.*s", (unsigned)pending, (unsigned)RF_TX_QUEUE_LIMIT, (int)len,
                 packet);
        return false;
    }
    if (len >= sizeof(buf)) {
        s_statDrop++;
        ESP_LOGW(TAG, "TNC2 packet too long (%u bytes), dropped", (unsigned)len);
        return false;
    }
    memcpy(buf, packet, len);
    buf[len] = 0;

    esp_err_t err = modem_send_tnc2(buf);
    if (err != ESP_OK) {
        s_statErr++;
        ESP_LOGW(TAG, "modem_send_tnc2() failed: %s (\"%s\")", esp_err_to_name(err), buf);
        return false;
    }
    s_statRadioTx++;
    return true;
}

// ---------------------------------------------------------------------------
// AX25Msg -> TNC2 text line ("SRC-N>DST-N,PATH...:info"), shared by the digi
// re-transmit path, the igate RF->INET path (igate.c builds its own header
// internally) and message parsing (which works on TNC2 text either way).
//
// This used to be a local ax25ToTnc2(); the component now ships exactly the
// same rendering as modem_format_tnc2(), so this is a thin length-returning
// wrapper over it rather than a second copy that could drift.
// ---------------------------------------------------------------------------
static int ax25ToTnc2(const ax25_msg_t *m, char *out, size_t outMax) {
    modem_format_tnc2(m, out, outMax);
    return (int)strlen(out);
}

/**
 * @brief Single dispatch point for digipeater / igate / message, fed by
 * on_rx_frame() below for every decoded RX frame.
 */
static void aprs_msg_callback(ax25_msg_t *msg) {
    char tnc2[400];
    ax25ToTnc2(msg, tnc2, sizeof(tnc2));

