hiperiondev/esp32idf_APRS/main/aprs_service.c
        // g_config.inet2rfFilter is a whitelist of payload types (the IGATE
        // Filter fieldset on the /igate page): classify the line and drop it
        // unless its bit is set. Unclassifiable payloads - third-party
        // traffic in particular, which is exactly how an IGate loop starts -
        // classify as 0 and never pass.
        //
        // Dropped lines are logged at debug level only: the RX-IS entry
        // igate.c already added to the traffic ring covers them, and an
        // unfiltered APRS-IS feed would otherwise flush the ring with lines
        // that never went anywhere.
        uint16_t type = aprs_filter_classify_tnc2(line);
        if (!aprs_filter_pass(g_config.inet2rfFilter, type)) {
            ESP_LOGD(TAG, "INET2RF filtered (%s, mask=0x%03X): %s", aprs_filter_type_name(type), (unsigned)g_config.inet2rfFilter, line);
            return;
        }

        if (aprs_service_send_tnc2(line, strlen(line))) {
            s_statInet2Rf++;
            ESP_LOGD(TAG, "INET2RF TX: %s", line);
            trafficlog_add_pkt("INET2RF", callsign, line, -1, symTable, symCode);
        }
    }
}

// ---------------------------------------------------------------------------
// Outbound message TX: message.c hands us a built TNC2 packet + channel mask.
// ---------------------------------------------------------------------------
static void messageTxHandler(const char *packet, size_t len, uint8_t channels) {
    if (channels & MSG_CHANNEL_RF)
        aprs_service_send_tnc2(packet, len);
    if (channels & MSG_CHANNEL_INET)
        igate_send_raw(packet, len);
}

// The old afskPollTask() is gone: AFSK_Poll()/APRS_poll() were the previous
// component's "the application must pump the DSP and drain the frame queue"
// contract. esp32idf_radioamateur_modem owns both - AFSK_init() starts its own
// pinned RX DSP task, and modem_init() starts the "modem_svc" task that drives
// AFSK_ServiceTx()/Ax25TransmitCheck() and drains RX frames into the callback.
// Calling AFSK_Poll() from here would now race that task over the same FIFO.
// (The old AFSK_Poll(false, g_config.rf_power) also carried the RF power-switch
// pin; the new component has no such output, and rf_power/band were dead
// config with no consumer anywhere in the app, so both were removed - see
// the Radio/Modem page's Save handler and app_config.c.)

static void serviceTickTask(void *arg) {
    while (1) {
        if (g_config.msg_enable)
            sendAPRSMessageRetry();
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

// ---------------------------------------------------------------------------
// Audio ADC/DAC AFSK modem "LOOP TEST" (Radio/Modem webconfig page).
// ---------------------------------------------------------------------------

#define LOOP_TEST_TIMEOUT_MS 4000

static SemaphoreHandle_t s_loopTestSem = NULL;
static volatile bool s_loopTestActive = false;
static volatile bool s_loopTestGotFrame = false;
static char s_loopTestToken[8];
static char s_loopTestRxInfo[128];
static uint16_t s_loopTestRxMVrms = 0;

void aprs_service_notify_modem_ready(void) {
    s_modemReady = true;
}

bool aprs_service_modem_ready(void) {
    return s_modemReady;
}

// ---------------------------------------------------------------------------
// Loop-test diagnostics.
//
// The old component exposed purpose-built latching diagnostics for this
// (AFSK_getAdcDiag/AFSK_getSquelchDiag/AFSK_getAgcDiag/Modem_getDcdDiag*/
// Ax25GetFrameDiag/Ax25GetFailedFrame). The new one exposes instantaneous
// getters instead - afskGetRms(), afskGetAgcGain(), afskGetDcOffset(),
// ModemDcdState(), Ax25GetRxStage(), ModemGetSignalLevel() - plus a passive
// raw-sample tap, afskDiagCaptureRaw(), that reads straight out of the
// conversion ISR without disturbing the live RX task.
//
// So the latching is done here instead: a monitor task samples those getters
// throughout the test window and records the peaks/high-water marks the
// failure messages need. This keeps every distinction the old diagnostics drew
// (ADC dead vs. no tone vs. tone but no lock vs. lock but no frame) with two
// exceptions, noted where they are reported:
//   - there is no software squelch, so no "squelch never opened" case;
//   - there are no CRC-failure counters, so the furthest HDLC RX stage reached
//     stands in for the old "N frame attempts seen, all failed CRC".
// ---------------------------------------------------------------------------
#define LOOP_DIAG_RAW_SAMPLES 512

typedef struct {
    volatile bool stop;
    // Raw ADC min/max, captured mid-preamble via the passive ISR tap.
    int16_t rawMin;
    int16_t rawMax;
    int rawCount;
    // High-water marks sampled across the whole test window.
    uint16_t mVrmsPeak;
    float agcGainPeak;
    uint8_t dcdLatch; // OR of ModemDcdState() - one bit per demodulator
    uint8_t rxStageMax[MODEM_MAX_DEMODULATOR_COUNT];
    uint32_t adcSamplesStart;
    uint32_t adcSamplesEnd;
    volatile TaskHandle_t task;
} loop_diag_t;

static loop_diag_t s_diag;

static void loopDiagTask(void *arg) {
    loop_diag_t *d = (loop_diag_t *)arg;
    static int16_t raw[LOOP_DIAG_RAW_SAMPLES];

    // Wait out the start of the preamble so the capture lands on real tone
    // rather than on the idle line, then take one passive snapshot.
    vTaskDelay(pdMS_TO_TICKS(50));
    d->rawCount = afskDiagCaptureRaw(raw, LOOP_DIAG_RAW_SAMPLES, 500);
    for (int i = 0; i < d->rawCount; i++) {
        if (raw[i] < d->rawMin)
            d->rawMin = raw[i];
        if (raw[i] > d->rawMax)
            d->rawMax = raw[i];
    }

    while (!d->stop) {
        uint16_t rms = afskGetRms();
        if (rms > d->mVrmsPeak)
            d->mVrmsPeak = rms;

        float gain = afskGetAgcGain();
        if (gain > d->agcGainPeak)
            d->agcGainPeak = gain;

        d->dcdLatch |= ModemDcdState();

        uint8_t demods = ModemGetDemodulatorCount();
        if (demods > MODEM_MAX_DEMODULATOR_COUNT)
            demods = MODEM_MAX_DEMODULATOR_COUNT;
        for (uint8_t i = 0; i < demods; i++) {
            uint8_t stage = (uint8_t)Ax25GetRxStage(i);
            if (stage > d->rxStageMax[i])
                d->rxStageMax[i] = stage;
        }

        d->adcSamplesEnd = afskGetAdcSampleCount();
        vTaskDelay(pdMS_TO_TICKS(2));
    }

    d->task = NULL;
    vTaskDelete(NULL);
}

static void loopDiagStart(void) {
    memset(&s_diag, 0, sizeof(s_diag));
    s_diag.rawMin = INT16_MAX;
    s_diag.rawMax = INT16_MIN;
    s_diag.adcSamplesStart = afskGetAdcSampleCount();
    s_diag.adcSamplesEnd = s_diag.adcSamplesStart;
    s_diag.stop = false;
    if (xTaskCreate(loopDiagTask, "loop_diag", 3072, &s_diag, 7, (TaskHandle_t *)&s_diag.task) != pdPASS) {
        s_diag.task = NULL;
        ESP_LOGW(TAG, "Loop test: could not start the diagnostics task - a failure will be reported without detail");
    }
}

